app/controllers/users_controller.rb

INSERT INTO "users" ("email_not_validated", "password_reset_code_created_on", "created_at", "email_verification_code_created_on", "crypted_password", "password_reset_code", "updated_at", "custom_parameters", "owner_id", "device_id", "password_salt", "full_name", "email_verification_code", "phone", "website", "persistence_token", "login", "email") VALUES(NULL, NULL, '2010-05-18 14:24:20', NULL, 'bfa1831377439639f6de527cbe03392d0ba705e24b03ef0a3fe95dee2a881652bbe22d12d9b5edc8b2d8486ad59e3c6cdf6959fda01d321fb026102cc9f0f0f2', NULL, '2010-05-18 14:24:20', '--- {}
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT * FROM "users" WHERE ("users"."email" IS NULL) LIMIT 1
---
  def resetmypasswordbyemail
    @user = User.find_by_email(params[:email]) if params[:email].present?

SELECT * FROM "owners" WHERE ("owners"."id" = '1') LIMIT 1
SELECT * FROM "users" WHERE ("users"."login" = 'test') LIMIT 1
---
  def authenticate
    @user = User.new
    @owner = Owner.find_by_id params[:owner_id]
    unless @owner
      @user.errors.add :owner, 'does not exist'
      logger.debug "UsersController#authenticate #{@user.errors.to_xml}"
      return render :xml => @user.errors, :status => :unprocessable_entity
    end
    case @owner.authorization_type
    when 'device'
      if params[:device_id].blank?
        @user.errors.add :device_id, 'cannot be blank'
        return render :xml => @user.errors, :status => :unprocessable_entity
      end
      @user = User.find_by_device_id(params[:device_id]) or raise(ActiveRecord::RecordNotFound)
      @session = UserSession.new @user
    when 'login'
      if params[:login].blank?
        @user.errors.add :login, 'cannot be blank'
        return render :xml => @user.errors, :status => :unprocessable_entity
      end
      @user = User.find_by_login(params[:login]) or raise(ActiveRecord::RecordNotFound)

UPDATE "users" SET "updated_at" = '2010-05-31 14:38:48', "custom_parameters" = '--- {}
---
      @session = UserSession.new :login => params[:login], :password => params[:password]
      @user = @session.user
    end
    return render :nothing => true, :status => :unauthorized unless @session.save